grevaillot/svd_tools/headers/STM32G483xx/tim20.h
/** @defgroup tim20_rcr RCR repetition counter register
@{*/


#define TIM20_RCR_REP_SHIFT		0
#define TIM20_RCR_REP_MASK		0xffff
/** @defgroup tim20_rcr_rep REP Repetition counter value
@{*/
/**@}*/


/**@}*/

/** @defgroup tim20_ccr1 CCR1 capture/compare register 1
@{*/


#define TIM20_CCR1_CCR1_SHIFT		0
#define TIM20_CCR1_CCR1_MASK		0xffff
/** @defgroup tim20_ccr1_ccr1 CCR1 Capture/Compare 1 value
@{*/
/**@}*/


/**@}*/

/** @defgroup tim20_ccr2 CCR2 capture/compare register 2
@{*/


#define TIM20_CCR2_CCR2_SHIFT		0
#define TIM20_CCR2_CCR2_MASK		0xffff
/** @defgroup tim20_ccr2_ccr2 CCR2 Capture/Compare 2 value
@{*/
/**@}*/


/**@}*/

/** @defgroup tim20_ccr3 CCR3 capture/compare register 3
@{*/


#define TIM20_CCR3_CCR3_SHIFT		0
#define TIM20_CCR3_CCR3_MASK		0xffff
/** @defgroup tim20_ccr3_ccr3 CCR3 Capture/Compare value
@{*/
/**@}*/


/**@}*/

/** @defgroup tim20_ccr4 CCR4 capture/compare register 4
@{*/


#define TIM20_CCR4_CCR4_SHIFT		0
#define TIM20_CCR4_CCR4_MASK		0xffff
/** @defgroup tim20_ccr4_ccr4 CCR4 Capture/Compare value
@{*/
/**@}*/


/**@}*/

/** @defgroup tim20_bdtr BDTR break and dead-time register
@{*/

/** TIM20_BDTR_BK2ID BK2ID **/
#define TIM20_BDTR_BK2ID		(1 << 29)
/** TIM20_BDTR_BKBID BKBID **/
#define TIM20_BDTR_BKBID		(1 << 28)
/** TIM20_BDTR_BK2DSRM BK2DSRM **/
#define TIM20_BDTR_BK2DSRM		(1 << 27)
/** TIM20_BDTR_BKDSRM BKDSRM **/
#define TIM20_BDTR_BKDSRM		(1 << 26)
/** TIM20_BDTR_BK2P Break 2 polarity **/
#define TIM20_BDTR_BK2P		(1 << 25)
/** TIM20_BDTR_BK2E Break 2 Enable **/
#define TIM20_BDTR_BK2E		(1 << 24)

#define TIM20_BDTR_BK2F_SHIFT		20
#define TIM20_BDTR_BK2F_MASK		0x0f
/** @defgroup tim20_bdtr_bk2f BK2F Break 2 filter
@{*/
/**@}*/


#define TIM20_BDTR_BKF_SHIFT		16
#define TIM20_BDTR_BKF_MASK		0x0f
/** @defgroup tim20_bdtr_bkf BKF Break filter
@{*/
/**@}*/

/** TIM20_BDTR_MOE Main output enable **/
#define TIM20_BDTR_MOE		(1 << 15)
/** TIM20_BDTR_AOE Automatic output enable **/
#define TIM20_BDTR_AOE		(1 << 14)
/** TIM20_BDTR_BKP Break polarity **/
#define TIM20_BDTR_BKP		(1 << 13)
/** TIM20_BDTR_BKE Break enable **/
#define TIM20_BDTR_BKE		(1 << 12)
/** TIM20_BDTR_OSSR Off-state selection for Run mode **/
#define TIM20_BDTR_OSSR		(1 << 11)
/** TIM20_BDTR_OSSI Off-state selection for Idle mode **/
#define TIM20_BDTR_OSSI		(1 << 10)

#define TIM20_BDTR_LOCK_SHIFT		8
#define TIM20_BDTR_LOCK_MASK		0x03
/** @defgroup tim20_bdtr_lock LOCK Lock configuration
@{*/
/**@}*/


#define TIM20_BDTR_DTG_SHIFT		0
#define TIM20_BDTR_DTG_MASK		0xff
/** @defgroup tim20_bdtr_dtg DTG Dead-time generator setup
@{*/
/**@}*/


/**@}*/

/** @defgroup tim20_ccr5 CCR5 capture/compare register 4
@{*/

/** TIM20_CCR5_GC5C3 Group Channel 5 and Channel 3 **/
#define TIM20_CCR5_GC5C3		(1 << 31)
/** TIM20_CCR5_GC5C2 Group Channel 5 and Channel 2 **/
#define TIM20_CCR5_GC5C2		(1 << 30)
/** TIM20_CCR5_GC5C1 Group Channel 5 and Channel 1 **/
#define TIM20_CCR5_GC5C1		(1 << 29)

#define TIM20_CCR5_CCR5_SHIFT		0
#define TIM20_CCR5_CCR5_MASK		0xffff
/** @defgroup tim20_ccr5_ccr5 CCR5 Capture/Compare value
@{*/
/**@}*/


/**@}*/

/** @defgroup tim20_ccr6 CCR6 capture/compare register 4
@{*/


#define TIM20_CCR6_CCR6_SHIFT		0
#define TIM20_CCR6_CCR6_MASK		0xffff
/** @defgroup tim20_ccr6_ccr6 CCR6 Capture/Compare value
@{*/
/**@}*/


/**@}*/

/** @defgroup tim20_ccmr3_output CCMR3Output capture/compare mode register 2 (output mode)
@{*/

/** TIM20_CCMR3_Output_OC6M_bit3 Output Compare 6 mode bit 3 **/
#define TIM20_CCMR3_Output_OC6M_bit3		(1 << 24)

#define TIM20_CCMR3_Output_OC5M_bit3_SHIFT		16
#define TIM20_CCMR3_Output_OC5M_bit3_MASK		0x07
/** @defgroup tim20_ccmr3_output_oc5m_bit3 OC5Mbit3 Output Compare 5 mode bit 3
@{*/
/**@}*/

/** TIM20_CCMR3_Output_OC6CE Output compare 6 clear enable **/
#define TIM20_CCMR3_Output_OC6CE		(1 << 15)

#define TIM20_CCMR3_Output_OC6M_SHIFT		12
#define TIM20_CCMR3_Output_OC6M_MASK		0x07
/** @defgroup tim20_ccmr3_output_oc6m OC6M Output compare 6 mode
@{*/
/**@}*/

/** TIM20_CCMR3_Output_OC6PE Output compare 6 preload enable **/
#define TIM20_CCMR3_Output_OC6PE		(1 << 11)
/** TIM20_CCMR3_Output_OC6FE Output compare 6 fast enable **/
#define TIM20_CCMR3_Output_OC6FE		(1 << 10)
/** TIM20_CCMR3_Output_OC5CE Output compare 5 clear enable **/
#define TIM20_CCMR3_Output_OC5CE		(1 << 7)

#define TIM20_CCMR3_Output_OC5M_SHIFT		4
#define TIM20_CCMR3_Output_OC5M_MASK		0x07
/** @defgroup tim20_ccmr3_output_oc5m OC5M Output compare 5 mode
@{*/
/**@}*/

/** TIM20_CCMR3_Output_OC5PE Output compare 5 preload enable **/
#define TIM20_CCMR3_Output_OC5PE		(1 << 3)
/** TIM20_CCMR3_Output_OC5FE Output compare 5 fast enable **/
#define TIM20_CCMR3_Output_OC5FE		(1 << 2)

/**@}*/

/** @defgroup tim20_dtr2 DTR2 timer Deadtime Register 2
@{*/

/** TIM20_DTR2_DTPE Deadtime Preload Enable **/
#define TIM20_DTR2_DTPE		(1 << 17)
/** TIM20_DTR2_DTAE Deadtime Asymmetric Enable **/
#define TIM20_DTR2_DTAE		(1 << 16)

#define TIM20_DTR2_DTGF_SHIFT		0
#define TIM20_DTR2_DTGF_MASK		0xff
/** @defgroup tim20_dtr2_dtgf DTGF Dead-time falling edge generator setup
@{*/
/**@}*/


/**@}*/

/** @defgroup tim20_ecr ECR DMA control register
@{*/


#define TIM20_ECR_PWPRSC_SHIFT		24
#define TIM20_ECR_PWPRSC_MASK		0x07
/** @defgroup tim20_ecr_pwprsc PWPRSC Pulse Width prescaler
@{*/
/**@}*/


#define TIM20_ECR_PW_SHIFT		16
#define TIM20_ECR_PW_MASK		0xff
/** @defgroup tim20_ecr_pw PW Pulse width
@{*/
/**@}*/


#define TIM20_ECR_IPOS_SHIFT		6
#define TIM20_ECR_IPOS_MASK		0x03
/** @defgroup tim20_ecr_ipos IPOS Index Positioning
@{*/
/**@}*/

/** TIM20_ECR_FIDX First Index **/
#define TIM20_ECR_FIDX		(1 << 5)

#define TIM20_ECR_IBLK_SHIFT		3
#define TIM20_ECR_IBLK_MASK		0x03
/** @defgroup tim20_ecr_iblk IBLK Index Blanking
@{*/
/**@}*/


#define TIM20_ECR_IDIR_SHIFT		1
#define TIM20_ECR_IDIR_MASK		0x03
/** @defgroup tim20_ecr_idir IDIR Index Direction
@{*/
/**@}*/

/** TIM20_ECR_IE Index Enable **/
#define TIM20_ECR_IE		(1 << 0)

/**@}*/

/** @defgroup tim20_tisel TISEL TIM timer input selection register
@{*/


#define TIM20_TISEL_TI4SEL_SHIFT		24
#define TIM20_TISEL_TI4SEL_MASK		0x0f
/** @defgroup tim20_tisel_ti4sel TI4SEL TI4[0] to TI4[15] input selection
@{*/
/**@}*/


#define TIM20_TISEL_TI3SEL_SHIFT		16
#define TIM20_TISEL_TI3SEL_MASK		0x0f
/** @defgroup tim20_tisel_ti3sel TI3SEL TI3[0] to TI3[15] input selection
@{*/
/**@}*/


