grevaillot/svd_tools/headers/STM32G483xx/tim20.h
#define TIM20_TISEL_TI2SEL_SHIFT		8
#define TIM20_TISEL_TI2SEL_MASK		0x0f
/** @defgroup tim20_tisel_ti2sel TI2SEL TI2[0] to TI2[15] input selection
@{*/
/**@}*/


#define TIM20_TISEL_TI1SEL_SHIFT		0
#define TIM20_TISEL_TI1SEL_MASK		0x0f
/** @defgroup tim20_tisel_ti1sel TI1SEL TI1[0] to TI1[15] input selection
@{*/
/**@}*/


/**@}*/

/** @defgroup tim20_af1 AF1 TIM alternate function option register 1
@{*/


#define TIM20_AF1_ETRSEL_SHIFT		14
#define TIM20_AF1_ETRSEL_MASK		0x0f
/** @defgroup tim20_af1_etrsel ETRSEL ETR source selection
@{*/
/**@}*/

/** TIM20_AF1_BKCMP4P BRK COMP4 input polarity **/
#define TIM20_AF1_BKCMP4P		(1 << 13)
/** TIM20_AF1_BKCMP3P BRK COMP3 input polarity **/
#define TIM20_AF1_BKCMP3P		(1 << 12)
/** TIM20_AF1_BKCMP2P BRK COMP2 input polarity **/
#define TIM20_AF1_BKCMP2P		(1 << 11)
/** TIM20_AF1_BKCMP1P BRK COMP1 input polarity **/
#define TIM20_AF1_BKCMP1P		(1 << 10)
/** TIM20_AF1_BKINP BRK BKIN input polarity **/
#define TIM20_AF1_BKINP		(1 << 9)
/** TIM20_AF1_BKCMP7E BRK COMP7 enable **/
#define TIM20_AF1_BKCMP7E		(1 << 7)
/** TIM20_AF1_BKCMP6E BRK COMP6 enable **/
#define TIM20_AF1_BKCMP6E		(1 << 6)
/** TIM20_AF1_BKCMP5E BRK COMP5 enable **/
#define TIM20_AF1_BKCMP5E		(1 << 5)
/** TIM20_AF1_BKCMP4E BRK COMP4 enable **/
#define TIM20_AF1_BKCMP4E		(1 << 4)
/** TIM20_AF1_BKCMP3E BRK COMP3 enable **/
#define TIM20_AF1_BKCMP3E		(1 << 3)
/** TIM20_AF1_BKCMP2E BRK COMP2 enable **/
#define TIM20_AF1_BKCMP2E		(1 << 2)
/** TIM20_AF1_BKCMP1E BRK COMP1 enable **/
#define TIM20_AF1_BKCMP1E		(1 << 1)
/** TIM20_AF1_BKINE BRK BKIN input enable **/
#define TIM20_AF1_BKINE		(1 << 0)

/**@}*/

/** @defgroup tim20_af2 AF2 TIM alternate function option register 2
@{*/


#define TIM20_AF2_OCRSEL_SHIFT		16
#define TIM20_AF2_OCRSEL_MASK		0x07
/** @defgroup tim20_af2_ocrsel OCRSEL OCREF_CLR source selection
@{*/
/**@}*/

/** TIM20_AF2_BK2CMP4P BRK2 COMP4 input polarity **/
#define TIM20_AF2_BK2CMP4P		(1 << 13)
/** TIM20_AF2_BK2CMP3P BRK2 COMP3 input polarity **/
#define TIM20_AF2_BK2CMP3P		(1 << 12)
/** TIM20_AF2_BK2CMP2P BRK2 COMP2 input polarity **/
#define TIM20_AF2_BK2CMP2P		(1 << 11)
/** TIM20_AF2_BK2CMP1P BRK2 COMP1 input polarity **/
#define TIM20_AF2_BK2CMP1P		(1 << 10)
/** TIM20_AF2_BK2INP BRK2 BKIN input polarity **/
#define TIM20_AF2_BK2INP		(1 << 9)
/** TIM20_AF2_BK2CMP7E BRK2 COMP7 enable **/
#define TIM20_AF2_BK2CMP7E		(1 << 7)
/** TIM20_AF2_BK2CMP6E BRK2 COMP6 enable **/
#define TIM20_AF2_BK2CMP6E		(1 << 6)
/** TIM20_AF2_BK2CMP5E BRK2 COMP5 enable **/
#define TIM20_AF2_BK2CMP5E		(1 << 5)
/** TIM20_AF2_BK2CMP4E BRK2 COMP4 enable **/
#define TIM20_AF2_BK2CMP4E		(1 << 4)
/** TIM20_AF2_BK2CMP3E BRK2 COMP3 enable **/
#define TIM20_AF2_BK2CMP3E		(1 << 3)
/** TIM20_AF2_BK2CMP2E BRK2 COMP2 enable **/
#define TIM20_AF2_BK2CMP2E		(1 << 2)
/** TIM20_AF2_BK2CMP1E BRK2 COMP1 enable **/
#define TIM20_AF2_BK2CMP1E		(1 << 1)
/** TIM20_AF2_BKINE BRK BKIN input enable **/
#define TIM20_AF2_BKINE		(1 << 0)

/**@}*/

/** @defgroup tim20_dcr DCR control register
@{*/


#define TIM20_DCR_DBL_SHIFT		8
#define TIM20_DCR_DBL_MASK		0x1f
/** @defgroup tim20_dcr_dbl DBL DMA burst length
@{*/
/**@}*/


#define TIM20_DCR_DBA_SHIFT		0
#define TIM20_DCR_DBA_MASK		0x1f
/** @defgroup tim20_dcr_dba DBA DMA base address
@{*/
/**@}*/


/**@}*/

/** @defgroup tim20_dmar DMAR DMA address for full transfer
@{*/


#define TIM20_DMAR_DMAB_SHIFT		0
#define TIM20_DMAR_DMAB_MASK		0xffffffff
/** @defgroup tim20_dmar_dmab DMAB DMA register for burst accesses
@{*/
/**@}*/


/**@}*/
